import MainLayout from 'components/layouts/MainLayout'

export default () => (
  <MainLayout title="Preface">
    <h1>О чём это</h1>
    <p>Программировать — сложно.</p>
    <p>
      Хороший код должен адекватно отражать систему, которую описывает, и должен быть устойчив к изменениям в этой
      системе.
    </p>
    <p>
      Проблемы с кодом возникают, когда он перестаёт соответствовать реальности — бизнес-требованиям, правилам поведения
      частей системы, их отношениям друг с другом.
    </p>
    <p>
      Бизнес-правила — это территория. Код — карта этой территории. Чем точнее карта, тем проще справляться с
      изменениями в требованиях и даже предвидеть их.
    </p>
    <p>
      В этой серии статей мы хотим рассказать и показать на примерах, как принципы ООП могут помочь спроектировать
      устойчивую систему.
    </p>
  </MainLayout>
)
